In [8]:
%matplotlib inline
import numpy as np              
import pandas as pd

In [9]:
loose=pd.read_csv('original-sheets\Responses-Loose.csv')
student_info=pd.read_csv('corpus-files\student_information.csv')
course=pd.read_csv('corpus-files\course.csv')
answer_df=pd.read_csv('answer.csv',index_col = 'answer_id', low_memory=False)

In [10]:
#dropping to only relevant columns
loose=loose.drop(columns=['3Langs','Item','gender','course_id','class_id','version','text1_len','text2_len','text1',
                         'text2 (line breaks/extra spaces removed, spaces added to reach 60)','Judgement','Notes'])

In [11]:
course_=course.drop(columns=['class_id','semester','section'])

student=student_info.drop(columns=['birth_year','language_used_at_home','non_native_language_1','yrs_of_study_lang1',
                                  'study_in_classroom_lang1','ways_of_study_lang1','non_native_language_2','study_in_classroom_lang2',
                                  'ways_of_study_lang2','non_native_language_3','yrs_of_study_lang3','study_in_classroom_lang3',
                                  'ways_of_study_lang3','yrs_of_english_learning','yrs_in_english_environment','yrs_of_study_lang2'])
answer_=answer_df[['question_id','anon_id','course_id','version','text_len','text','tokens']].reset_index()

In [12]:
#Cleaning the answer df
col='course_id'
answer=rmStr(answer_, col) #removes strings from answer_.course_id

NameError: name 'rmStr' is not defined

In [17]:
# Merging the datasets

#merge_ans=answer_[['anon_id','course_id']] #sets answer df up for merging 
#student_merge=student.drop(columns=['course_history']) #set student df up for merging

student_ans=student.merge(answer_,on='anon_id').astype({'course_id':'int64'}) #merges student and answers

stu_ans_crs=student_ans.merge(course_, on='course_id')
#.drop(columns=['age','course_id','version','tokens']) #merges the student-answers df with course df

In [21]:
# function that finds the unique values in a list
def get_uniques(x):
    return list(x.unique())

# Whole Dataset

In [18]:
stu_ans_crs

,anon_id,gender,native_language,course_history,age,answer_id,question_id,course_id,version,text_len,text,tokens,level_id
0,do6,Female,Russian,5;11;18;24;29;105;117;153,31.0,150,4,117,1,299,Some people prefer eat out and some like doing...,"['Some', 'people', 'prefer', 'eat', 'out', 'an...",5
1,do6,Female,Russian,5;11;18;24;29;105;117;153,31.0,1221,97,117,1,288,My opinion is that a person does need educatio...,"['My', 'opinion', 'is', 'that', 'a', 'person',...",5
2,do6,Female,Russian,5;11;18;24;29;105;117;153,31.0,1957,189,117,1,321,There are two national rooms in the Cathedral ...,"['There', 'are', 'two', 'national', 'rooms', '...",5
3,do6,Female,Russian,5;11;18;24;29;105;117;153,31.0,2164,190,117,1,464,There are two nation rooms in the Cathedral of...,"['There', 'are', 'two', 'nation', 'rooms', 'in...",5
4,bv5,Male,Arabic,3;9;15;21;27;49;57;71;82;93;117,21.0,151,4,117,1,315,"""Not all learning takes place in the classroom...","['``', 'Not', 'all', 'learning', 'takes', 'pla...",5
...,...,...,...,...,...,...,...,...,...,...,...,...,...
46225,cy7,Female,Korean,NaN,NaN,47682,6066,1034,1,10,1. emphasis\n2. appropriate\n3. requires\n4. a...,"['1', '.', 'emphasis', '2', '.', 'appropriate'...",3
46226,fp7,Female,Turkish,NaN,NaN,47823,6066,1034,1,10,1.emphasis \n2.appropriate\n3.requires\n4.anal...,"['1', '.', 'emphasis', '2', '.', 'appropriate'...",3
46227,fq6,Male,Chinese,NaN,NaN,47824,6066,1034,1,10,1.emphasis\n2.appropriate\n3.requires\n4.analy...,"['1', '.', 'emphasis', '2', '.', 'appropriate'...",3
46228,di6,Male,Chinese,NaN,NaN,47787,6066,1034,1,10,1 emphasis\n2 normal\n3 requires\n4 analyze\n5...,"['1', 'emphasis', '2', 'normal', '3', 'require...",3
46229,fm3,Unknown,Arabic,NaN,NaN,47725,6066,1034,1,10,1- emphasis\n2- appropriate\n3- requires\n4- a...,"['1', '-', 'emphasis', '2', '-', 'appropriate'...",3

In [41]:
sac_lvls=stu_ans_crs[['anon_id','native_language','level_id','question_id','text']]
sac_lvls_rkc=sac_lvls

index=0
for i in sac_lvls_rkc.native_language:
    if (i != 'Korean' and i != 'Spanish' and i != 'Chinese'):
        sac_lvls_rkc=sac_lvls_rkc.drop(index)
    index+=1

sac_lvls_rkc=sac_lvls_rkc.reset_index()

sac_lvls_rkc

,anon_id,native_language,level_id,question_id,text
13,ax4,Chinese,5,48,The Effects on Students Who Have a Part-time J...
14,ax4,Chinese,5,97,There are many different kinds of people in th...
15,ax4,Chinese,5,74,Should the Death Penalty Exist\nThe death pena...
16,ax4,Chinese,5,119,Should the Death Penalty Exist?\nThe death pen...
17,ax4,Chinese,5,189,The Nationality rooms built in the Cathedral o...
...,...,...,...,...,...
46218,cz3,Korean,3,6087,I have studied Visual Design since 2002. I gra...
46219,cz3,Korean,3,6119,I will describe about my ideal home. I want qu...
46225,cy7,Korean,3,6066,1. emphasis\n2. appropriate\n3. requires\n4. a...
46227,fq6,Chinese,3,6066,1.emphasis\n2.appropriate\n3.requires\n4.analy...
46228,di6,Chinese,3,6066,1 emphasis\n2 normal\n3 requires\n4 analyze\n5...

In [22]:
# allows us to see what levels each anon_id participated in 
lvl_list=sac_lvls_rkc.groupby('anon_id').agg(n_uniq=('question_id','nunique'), lvl_nums=('question_id',get_uniques))
lvl_list=lvl_list.reset_index()

In [28]:
unique_q=sac_lvls_rkc.groupby('native_language').agg(n_uniq=('question_id','nunique'))
unique_q=unique_q.reset_index()

In [29]:
unique_q

  native_language  n_uniq
0         Chinese    3708
1          Korean    3345
2         Spanish    1513

In [32]:
unique_t=sac_lvls_rkc.groupby('native_language').agg(n_uniq=('text','nunique'))
unique_t=unique_t.reset_index()
unique_t

  native_language  n_uniq
0         Chinese    7652
1          Korean    7915
2         Spanish    1794

In [33]:
unique_a=sac_lvls_rkc.groupby('native_language').agg(n_uniq=('anon_id','nunique'))
unique_a=unique_a.reset_index()
unique_a

  native_language  n_uniq
0         Chinese     220
1          Korean     214
2         Spanish      57

In [45]:
sac_lvls_rkc=sac_lvls_rkc.reset_index()
sac_lvls_rkc

,index,anon_id,native_language,level_id,question_id,text
0,13,ax4,Chinese,5,48,The Effects on Students Who Have a Part-time J...
1,14,ax4,Chinese,5,97,There are many different kinds of people in th...
2,15,ax4,Chinese,5,74,Should the Death Penalty Exist\nThe death pena...
3,16,ax4,Chinese,5,119,Should the Death Penalty Exist?\nThe death pen...
4,17,ax4,Chinese,5,189,The Nationality rooms built in the Cathedral o...
...,...,...,...,...,...,...
19633,46218,cz3,Korean,3,6087,I have studied Visual Design since 2002. I gra...
19634,46219,cz3,Korean,3,6119,I will describe about my ideal home. I want qu...
19635,46225,cy7,Korean,3,6066,1. emphasis\n2. appropriate\n3. requires\n4. a...
19636,46227,fq6,Chinese,3,6066,1.emphasis\n2.appropriate\n3.requires\n4.analy...
19637,46228,di6,Chinese,3,6066,1 emphasis\n2 normal\n3 requires\n4 analyze\n5...

In [46]:
#dividing my level 3 and language
sac_lvls_rkc3=sac_lvls_rkc

index=0
for i in sac_lvls_rkc3.level_id:
    if i!=3:
        sac_lvls_rkc3=sac_lvls_rkc3.drop(index)
    index+=1
    
sac_lvls_rkc3

,index,anon_id,native_language,level_id,question_id,text
1311,2478,fk5,Korean,3,34,I favorite subway restaurant and outback staek...
1312,2479,fk5,Korean,3,31,Here are a few instructions for typing in Engl...
1313,2480,fk5,Korean,3,98,"Personal Letter\n \n October 16, 2006 \n\nDear..."
1314,2481,fk5,Korean,3,98,"Personal Letter\n \n October 20, 2006 \nDear B..."
1315,2482,fk5,Korean,3,121,"Personal Letter\n \n October 20, 2006 \nDear B..."
...,...,...,...,...,...,...
19633,46218,cz3,Korean,3,6087,I have studied Visual Design since 2002. I gra...
19634,46219,cz3,Korean,3,6119,I will describe about my ideal home. I want qu...
19635,46225,cy7,Korean,3,6066,1. emphasis\n2. appropriate\n3. requires\n4. a...
19636,46227,fq6,Chinese,3,6066,1.emphasis\n2.appropriate\n3.requires\n4.analy...
19637,46228,di6,Chinese,3,6066,1 emphasis\n2 normal\n3 requires\n4 analyze\n5...

In [51]:
unique_q=sac_lvls_rkc3.groupby('native_language').agg(n_uniq=('question_id','nunique'))
unique_q=unique_q.reset_index()

unique_t=sac_lvls_rkc3.groupby('native_language').agg(n_uniq=('text','nunique'))
unique_t=unique_t.reset_index()

unique_a=sac_lvls_rkc3.groupby('native_language').agg(n_uniq=('anon_id','nunique'))
unique_a=unique_a.reset_index()

In [52]:
unique_q

  native_language  n_uniq
0         Chinese     880
1          Korean     669
2         Spanish     302

In [53]:
unique_t

  native_language  n_uniq
0         Chinese    1777
1          Korean    1466
2         Spanish     397

In [54]:
unique_a

  native_language  n_uniq
0         Chinese      86
1          Korean      88
2         Spanish      18

In [56]:
#dividing my level 4 and language
sac_lvls_rkc4=sac_lvls_rkc

index=0
for i in sac_lvls_rkc4.level_id:
    if i!=4:
        sac_lvls_rkc4=sac_lvls_rkc4.drop(index)
    index+=1
    
sac_lvls_rkc4=sac_lvls_rkc4.reset_index()

In [64]:
unique_q=sac_lvls_rkc4.groupby('native_language').agg(n_uniq=('question_id','nunique'))
unique_q=unique_q.reset_index()

unique_t=sac_lvls_rkc4.groupby('native_language').agg(n_uniq=('text','nunique'))
unique_t=unique_t.reset_index()

unique_a=sac_lvls_rkc4.groupby('native_language').agg(n_uniq=('anon_id','nunique'))
unique_a=unique_a.reset_index()

In [65]:
unique_t

  native_language  n_uniq
0         Chinese    2712
1          Korean    2955
2         Spanish     697

In [66]:
unique_a

  native_language  n_uniq
0         Chinese     154
1          Korean     151
2         Spanish      40

In [60]:
#dividing my level 5 and language
sac_lvls_rkc5=sac_lvls_rkc

index=0
for i in sac_lvls_rkc5.level_id:
    if i!=5:
        sac_lvls_rkc5=sac_lvls_rkc5.drop(index)
    index+=1
    
sac_lvls_rkc5=sac_lvls_rkc5.reset_index()

In [67]:
unique_q=sac_lvls_rkc5.groupby('native_language').agg(n_uniq=('question_id','nunique'))
unique_q=unique_q.reset_index()

unique_t=sac_lvls_rkc5.groupby('native_language').agg(n_uniq=('text','nunique'))
unique_t=unique_t.reset_index()

unique_a=sac_lvls_rkc5.groupby('native_language').agg(n_uniq=('anon_id','nunique'))
unique_a=unique_a.reset_index()

In [68]:
unique_t

  native_language  n_uniq
0         Chinese    3038
1          Korean    3182
2         Spanish     615

In [69]:
unique_a

  native_language  n_uniq
0         Chinese      96
1          Korean     112
2         Spanish      25

# Loose Dataset

In [72]:
loose=loose.dropna()
loose

,answer_id,anon_id,L1,level_id,question_id,text3_len,text3 (edits made to fix word counts)
0,141.0,aj8,Chinese,5.0,17.0,114.0,"Today, I am going to describe one of my classm..."
1,143.0,az8,Chinese,5.0,17.0,95.0,My niece is 3 years old who is my younger brot...
2,133.0,az2,Korean,5.0,17.0,128.0,"When I was in Germany, I met a friend who was ..."
3,135.0,at8,Korean,5.0,17.0,105.0,my friend is ANON_NAME_0. she is a my ELI frie...
4,188.0,eh9,Korean,5.0,17.0,97.0,Younghun is my best friend. His facial appeara...
...,...,...,...,...,...,...,...
1805,47845.0,ec1,Korean,4.0,6070.0,138.0,My best friend is Sohyun who graduated from th...
1806,47882.0,cq1,Spanish,4.0,6070.0,80.0,"My soul mate is Melissa, who has been my frien..."
1807,48246.0,bv8,Chinese,4.0,6105.0,131.0,The quote that talks about a true friend is so...
1808,48254.0,dr8,Korean,4.0,6105.0,162.0,I think this means that home is not just a pla...
1809,48252.0,bl3,Spanish,4.0,6105.0,146.0,This quotation means that the majority of peop...

In [85]:
    # this code gets how many times an id appeared (n_anon_ids) as well as an array of what levels they participated in (lvl_nums)
clean_ids_lvl_loose=loose.groupby('anon_id').agg(
    n_anon_ids_loose=('level_id', 'nunique'),
    lvl_nums_loose=('level_id', get_uniques)
)

#changes the clean_ids_lvl's index so we can access the anon_id easier
ind_loose= clean_ids_lvl_loose.reset_index()
ind_loose

    anon_id  n_anon_ids_loose lvl_nums_loose
0       aa0                 1          [5.0]
1       aa3                 1          [4.0]
2       aa8                 2     [4.0, 5.0]
3       aa9                 2     [3.0, 4.0]
4       ab6                 1          [4.0]
..      ...               ...            ...
278     gz2                 2     [4.0, 5.0]
279     gz5                 1          [4.0]
280     gz7                 1          [4.0]
281     ha0                 1          [5.0]
282     ha2                 2     [4.0, 5.0]

[283 rows x 3 columns]

In [86]:
# for loop that checks if lvl_nums has all three levels in it (3,4, and 5)
# if there are three values in lvl_nums, the anon_id is appended to the all_three list
ind=0
all_three_loose=[]
append=''
for i in ind_loose.anon_id:
    if ind_loose.iat[ind, 1]==3:
        append=ind_loose.at[ind,'anon_id']
        all_three_loose.append(append)
    ind=ind+1

all_three_loose.sort()
len(all_three_loose)

8

In [87]:
# creates list of participants in loose sheet that are in level 3 and 4
ind=0
in34_loose=[]
append=''
for i in ind_loose.anon_id:
    if ind_loose.iat[ind, 1]==2:
        if (3 in ind_loose.iat[ind,2] and 4 in ind_loose.iat[ind,2]):
            append=ind_loose.at[ind,'anon_id']
            in34_loose.append(append)
    elif ind_loose.iat[ind,1]==3:
        append=ind_loose.at[ind,'anon_id']
        in34_loose.append(append)
    ind=ind+1
in34_loose.sort()
print(len(in34_loose))

28

In [88]:
# creates list of participants in loose sheet that are in level 4 and 5
ind=0
in45_loose=[]
append=''
for i in ind_loose.anon_id:
    if ind_loose.iat[ind, 1]==2:
        if (4 in ind_loose.iat[ind,2] and 5 in ind_loose.iat[ind,2]):
            append=ind_loose.at[ind,'anon_id']
            in45_loose.append(append)
    elif ind_loose.iat[ind,1]==3:
        append=ind_loose.at[ind,'anon_id']
        in45_loose.append(append)
    ind=ind+1
in45_loose.sort()
print(len(in45_loose))

61

# Finding number of texts breakdown

In [89]:
all_three_loose

['an5', 'ar8', 'bl4', 'bp4', 'bv9', 'bz2', 'fa2', 'fy1']

In [90]:
all_three=loose
index=0
for i in all_three.anon_id:
    if i not in all_three_loose:
        all_three=all_three.drop(index)
    index+=1
    
all_three=all_three.reset_index()
all_three

,index,answer_id,anon_id,L1,level_id,question_id,text3_len,text3 (edits made to fix word counts)
0,245,6225.0,fa2,Spanish,3.0,975.0,65.0,My favorite restaurant is Atria's; I like it b...
1,343,7922.0,fa2,Spanish,3.0,1177.0,84.0,There is some advice you can do to improve you...
2,390,9275.0,fa2,Spanish,3.0,1354.0,79.0,Frida Kaloo was a famous Mexican artist. She w...
3,395,9358.0,fa2,Spanish,3.0,1381.0,106.0,Here are some tips that you have to do when yo...
4,425,10869.0,fa2,Spanish,3.0,1519.0,117.0,"I miss my dogs. I have seven dogs in Paraguay,..."
...,...,...,...,...,...,...,...,...
78,1667,37576.0,bv9,Korean,4.0,4867.0,84.0,"This article is about Anita Roddick, who overc..."
79,1704,39398.0,bp4,Chinese,4.0,5044.0,94.0,"My new room is bright, warm and fragrant. This..."
80,1724,40289.0,bp4,Chinese,4.0,5125.0,147.0,A best friend is who might be another you. May...
81,1741,42090.0,bv9,Korean,5.0,5366.0,213.0,"In the afternoon, there are a car accident and..."
82,1755,44050.0,bp4,Chinese,5.0,5612.0,274.0,Some people think Friday and Sunday is same fo...

In [98]:
loose34=loose
index=0
for i in loose34.anon_id:
    if i not in in34_loose:
        loose34=loose34.drop(index)
    index+=1
    
loose34=loose34.reset_index()
loose34

,index,answer_id,anon_id,L1,level_id,question_id,text3_len,text3 (edits made to fix word counts)
0,64,2593.0,gv1,Korean,3.0,302.0,72.0,"While I am going to home, I listened music. Wh..."
1,65,2600.0,aa9,Korean,3.0,302.0,60.0,"While I was taking the trolley yesterday, I sa..."
2,66,2697.0,fv7,Korean,3.0,302.0,108.0,I had a reunion with my friens. They were taki...
3,73,3394.0,aa9,Korean,3.0,312.0,150.0,I do a few things before I start to write. For...
4,77,2808.0,gv1,Korean,3.0,312.0,88.0,I think thay my writing habit is very commom. ...
...,...,...,...,...,...,...,...,...
249,1747,43471.0,cs5,Chinese,3.0,5533.0,217.0,What is friend in you pinion? The friend in my...
250,1750,43550.0,cf6,Korean,3.0,5533.0,82.0,There are many reasons to travel. First a fami...
251,1755,44050.0,bp4,Chinese,5.0,5612.0,274.0,Some people think Friday and Sunday is same fo...
252,1761,45235.0,cf6,Korean,4.0,5760.0,63.0,I think I could not do the samething as articl...
253,1774,46291.0,cf6,Korean,4.0,5904.0,72.0,The cause is 2.8km of low tide and high tide w...

In [92]:
loose45=loose
index=0
for i in loose45.anon_id:
    if i not in in45_loose:
        loose45=loose45.drop(index)
    index+=1
    
loose45=loose45.reset_index()
loose45

,index,answer_id,anon_id,L1,level_id,question_id,text3_len,text3 (edits made to fix word counts)
0,1,143.0,az8,Chinese,5.0,17.0,95.0,My niece is 3 years old who is my younger brot...
1,6,181.0,az8,Chinese,5.0,21.0,132.0,The Stonehenge located on the Plain of Salisbu...
2,12,542.0,az8,Chinese,5.0,62.0,188.0,Before the area of Decasia was a heartland tow...
3,15,985.0,az8,Chinese,5.0,95.0,179.0,My major was in the food science and nutrition...
4,20,1148.0,fa0,Korean,4.0,107.0,157.0,"According to increase the computer user, webah..."
...,...,...,...,...,...,...,...,...
717,1739,41656.0,bj2,Spanish,5.0,5294.0,201.0,When I had to choose my major in philosophy ma...
718,1741,42090.0,bv9,Korean,5.0,5366.0,213.0,"In the afternoon, there are a car accident and..."
719,1742,42086.0,bj2,Spanish,5.0,5366.0,242.0,"As you know, Japan has been suffering a terrib..."
720,1744,42154.0,aq1,Chinese,4.0,5385.0,359.0,Is your target to truly learn the second langu...
721,1755,44050.0,bp4,Chinese,5.0,5612.0,274.0,Some people think Friday and Sunday is same fo...

In [94]:
unique_t=all_three.groupby(['L1','level_id']).agg(n_uniq=('text3 (edits made to fix word counts)','nunique'))
unique_t=unique_t.reset_index()
unique_t

        L1  level_id  n_uniq
0  Chinese       3.0      11
1  Chinese       4.0       7
2  Chinese       5.0      16
3   Korean       3.0       6
4   Korean       4.0      16
5   Korean       5.0       4
6  Spanish       3.0      10
7  Spanish       4.0      10
8  Spanish       5.0       3

In [96]:
unique_t=loose34.groupby(['L1','level_id']).agg(n_uniq=('text3 (edits made to fix word counts)','nunique'))
unique_t=unique_t.reset_index()
unique_t

        L1  level_id  n_uniq
0  Chinese       3.0      30
1  Chinese       4.0      18
2  Chinese       5.0      16
3   Korean       3.0      56
4   Korean       4.0      86
5   Korean       5.0       4
6  Spanish       3.0      20
7  Spanish       4.0      21
8  Spanish       5.0       3

In [100]:
unique_t=loose45.groupby(['L1','level_id']).agg(n_uniq=('text3 (edits made to fix word counts)','nunique'))
unique_t=unique_t.reset_index()
unique_t

        L1  level_id  n_uniq
0  Chinese       3.0      11
1  Chinese       4.0     152
2  Chinese       5.0     142
3   Korean       3.0       6
4   Korean       4.0     179
5   Korean       5.0     104
6  Spanish       3.0      10
7  Spanish       4.0      66
8  Spanish       5.0      52